Repository: zabbix-jp/translation
Catalog: releasenote/releasenote-omegat.tmx
Source language: en_us
Languages: ja

source: [ZBX-1713] fixed adding user group to email alerts
ja: [ZBX-1713] Eメールアラートにユーザグループを追加する処理を修正

source: [ZBX-2555] fixed simple checks for FTP, POP, and NNTP protocols so that they close sessions properly
ja: [ZBX-2555] シンプルチェックのFTP、POP、NNTPプロトコルが適切にセッションをクローズするように修正

source: SQLite support has been implemented.
ja: SQLiteがサポートされます。

source: [ZBX-3621] changed the maximum number of processes for Zabbix daemons
ja: [ZBX-3621] Zabbixデーモンの最大プロセス数を変更

source: ZABBIX server will not shutdown but notify users and recover nicely if database is not available.
ja: データベースが利用できない場合、ZABBIXサーバーはシャットダウンせずにユーザーに通知し、正常に回復します。

source: [ZBX-2992] acknowledges are now hidden in event details when turned off
ja: [ZBX-2992] 障害対応コメントを無効にした時にイベント詳細画面で障害対応コメントを表示しないように修正

source: [ZBXNEXT-392] our daemons no longer crash after "strace -p"
ja: [ZBXNEXT-392] 「strace -p」を実行した際にデーモンがクラッシュしないように修正

source: [ZBX-4323] fixed host profile not created with host using API
ja: [ZBX-4323] APIを利用したホスト作成時にプロファイルが作成されない問題を修正

source: [ZBX-886] remove duplicate translation strings
ja: [ZBX-886] 重複した翻訳文字列を削除

source: [ZBX-386] fixed possible agent crash in processing of active checks
ja: [ZBX-386] アクティブチェックの処理中にエージェントがクラッシュする可能性がある問題を修正

source: added trigger dependencies in export/import
ja: エクスポート/インポートにトリガー依存関係を追加

source: Complete List of Bug Fixes and Improvements
ja: すべてのバグフィックスと改善の一覧

source: [ZBX-4241] added truncation of "ids" table to the database conversion procedure
ja: [ZBX-4241] データベース変換処理に「ids」テーブルの切り詰め処理を追加

source: [ZBX-1193] improved macros form
ja: [ZBX-1193] マクロのフォームを改善

source: [ZBX-2174] fixed a small memory leak in SNMP checks
ja: [ZBX-2174] SNMP監視の細微なメモリリークを修正

source: [ZBX-559] fixed wrong format of input file in help info of zabbix_sender
ja: [ZBX-559] zabbix_senderのヘルプ情報の入力ファイルのフォーマット間違いを修正

source: [DEV-429] added support of system.cpu.switches under Linux 2.4/2.6
ja: [DEV-429] Linux 2.4/2.6のキーsystem.cpu.switchesのサポートを追加

source: [ZBX-2339] fixed row height for type of information "text"
ja: [ZBX-2339] データ型が「テキスト」の場合の行の高さを修正

source: Complete List of Bug Fixes and Improvements included into 1.8.6rc1
ja: 1.8.6rc1に含まれるすべてのバグフィックスと改善の一覧

source: [ZBX-2210] added template replace option for hosts mass update
ja: [ZBX-2210] ホストの一括更新にテンプレートの置き換えオプションを追加

source: allowed processing of non-agent based checks for unreachable hosts
ja: 監視不可のホストのための非エージェント監視の処理を許可

source: [ZBX-287] fixed compilation under FreeBSD 4.1 with older GCC
ja: [ZBX-287] FreeBSD上で古いGCCを利用している場合のコンパイルを修正

source: [ZBX-3244] fixed dropdown changing its style when navigating menu
ja: [ZBX-3244] ナビゲートメニューのドロップダウンのスタイルを修正

source: [ZBX-1665] fixed hosts view in graphs configuration screen
ja: [ZBX-1665] グラフ設定画面のホストの表示を修正

source: [ZBX-3306] fixed minimal value limit for action escalation period
ja: [ZBX-3306] アクションのエスカレーションの期間の最小値を修正

source: [ZBX-1109] fixed row size on selection
ja: [ZBX-1109] 選択時の行のサイズを修正

source: New macro for trigger URL
ja: トリガーURLにマクロを追加

source: [ZBX-4056] fixed memory read access violation in Windows performance counters
ja: [ZBX-4056] Windowsパフォーマンスカウンタのメモリ読み込みアクセス違反を修正

source: [ZBX-2504] replaced 'Groups' by 'Replace host groups' in host mass-update form to avoid confusion
ja: [ZBX-2504] ホストの一括更新で「ホストグループの置き換え」で「グループ」を置き換えられるよう変更

source: [ZBX-2548] fixed sorting in items popup when adding items to simple graph, disabled dropdown with tooltip showing filtration added as well
ja: [ZBX-2548] シンプルグラフ(訳注: カスタムグラフの誤り)にアイテムを追加する際のポップアップのソート処理を修正し、 ホストを選択できない場合でも選択済み状態のドロップダウンを表示するように修正

source: [ZBX-1996] fixed JS error in IE7 in maps
ja: [ZBX-1996] IE7使用時にマップのJSエラーを修正

source: [ZBX-1571] fixed errors when adding proxy
ja: [ZBX-1571] プロキシ追加時のエラーを修正

source: [ZBX-1093] fixed graph scale calculation
ja: [ZBX-1093] グラフのスケールの計算を修正

source: ZABBIX Sender has been improved to support sending of multiple values by one network connection.
ja: ZABBIX Senderは1つのネットワークコネクションで複数のデータを送信するように改善されました。

source: [ZBXNEXT-436] added unacknwledged problem display for maps
ja: [ZBXNEXT-436] マップに障害対応コメントが追加されていない障害の表示機能を追加

source: [ZBX-1040] fixed error when massupdate triggers with empty dependency
ja: [ZBX-1040] 依存関係がないトリガーの一括更新を行ったときのエラーを修正

source: [ZBX-2946] fixed building from FreeBSD ports with libexecinfo installed; thanks to Dmitry Yakovlev
ja: [ZBX-2946] libexecinfoがインストールされた環境でFreeBSDのportsからビルドできるように修正; Dmitry Yakovlevに感謝

source: [ZBX-3566] fixed error in administration->notifications and added a hint when no mediatypes are defined
ja: [ZBX-3566] 管理->通知レポート画面のエラー修正とメディアタイプが定義されていない場合のヒントを追加

source: Improved support of numeric performance counters for Windows agents
ja: Windowsエージェントの、数値で示されるパフォーマンスカウンタの改善

source: [ZBX-2412] fixed deleting maps with API
ja: [ZBX-2412] APIのマップ削除処理を修正

source: [ZBX-1896] fixed no permission error when trying to view history for a web item
ja: [ZBX-1896] Webアイテムの履歴を表示しようとすると、権限なしのエラーが表示される問題を修正

source: It works much faster especially for larger setups.
ja: この改善は特に大規模なシステムで速度を改善します。

source: ZABBIX Proxy simplifies deployment and maintenances of the centralised distributed monitoring significantly.
ja: ZABBIXプロキシは分散モニタリングの集中監視のメンテナンスと配布を非常にシンプルにします。

source: [ZBX-488] fixed memory leak in ZABBIX server code
ja: [ZBX-488] ZABBIXサーバのメモリリークを修正

source: [ZBX-334] added sorting to group list in elements copy form
ja: [ZBX-334] コピーフォームにグループリスによる並べ替え機能を追加

source: The release supports MySQL only.
ja: MySQLのみサポートされます。

source: [ZBX-3210] fixed incorrect height scaling in graphs
ja: [ZBX-3210] グラフの高さの目盛りが誤っている問題を修正

source: Support of suffixes in trigger expressions
ja: トリガーの条件式の接尾辞のサポート

source: [ZBX-1299] added check for the minimal (1.0.0) libssh2 library version
ja: [ZBX-1299] libssh2ライブラリの必要最小バージョン(1.0.0)をチェックする機能を追加

source: [ZBX-3184] fixed 1000 vs. 1024 multipliers for bits, bytes, and other units in notification macros
ja: [ZBX-3184] 通知マクロでbitsやbytes、その他の単位の乗数に1000と1024のどちらを利用するかの処理を修正

source: The following sections describe the release in details and provide late-breaking or other information that supplements its main documentation.
ja: 以下にリリースの詳細を示します。これは最新の情報を提供し、主要なドキュメントの補足となります。

source: [ZBX-1975] fixed permission check in graphs with web items
ja: [ZBX-1975] Webアイテムのグラフの権限チェックを修正

source: [ZBX-2669] fixed not showing map label when background image is used
ja: [ZBX-2669] 背景画像を使用した場合にマップラベルが表示されない問題を修正

source: [ZBX-2503] fixed server and proxy crash with Oracle in cases DBUser and DBPassword parameters were not specified
ja: [ZBX-2503] DBUserとDBPasswordパラメータが指定されない場合、Oracleを使用したサーバやプロキシがクラッシュする問題を修正

source: Added Printable View for All Screens
ja: すべての画面に印刷用表示機能を追加

source: [ZBX-1650] allowed to pass "-" (dash) in parameters for "UserParameter" flexible parameters
ja: [ZBX-1650] 「UserParameter」パラメータに「-」 (ハイフン)を利用できるように修正

source: [ZBX-1011] zabbix_sender will send data in blocks of 250 values per TCP connection
ja: [ZBX-1011] ひとつのTCPコネクションで250ブロックの値を送信するようにzabbix_senderを修正

source: [ZBX-4085] fixed compilation issues for OS X Leopard
ja: [ZBX-4085] OS X Leopard上のコンパイル時の問題を修正

source: trailing newline added in the end of exported xml
ja: エクスポートしたXMLの末尾に空白行を追加

source: This document contains the release notes for Zabbix 1.8.3rc3.
ja: このドキュメントはZabbix 1.8.3rc3のリリースノートを含みます。

source: [ZBX-3808] updated Brazilian Portuguese translation; thanks to Murilo Moreira de Oliveira
ja: [ZBX-3808] ブラジル系ポルトガル語翻訳を更新; Murilo Moreira de Oliveiraに感謝

source: [ZBX-3672] fixed possible hang of history syncers when a zabbix[log] message added during process a history data
ja: [ZBX-3672] ヒストリデータ処理中にzabbix[log]メッセージが追加された時にヒストリの同期処理がハングアップしてしまう問題を修正

source: [ZBX-3301] fixed server crash after libssh2_userauth_list() when processing SSH checks
ja: [ZBX-3301] SSHチェック処理時、libssh2_userauth_list()呼び出し後にサーバがクラッシュする問題を修正

source: [ZBX-2612] fixed system.stat showing cpu idle and I/O wait time over 100% on AIX
ja: [ZBX-2612] AIXエージェントのsystem.statでCPU idleとI/O waitが100%を超える問題を修正

source: Now maps support highlighting of map elements depending on severity of problems and host statuses.
ja: また、マップ上のアイコンは障害の深刻度やホストのステータスによってハイライトすることができます。

source: A nice overview of the new features is at http://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.5.
ja: 新機能の概要はhttp://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.5から参照することができます。

source: [ZBX-2856] removed debug info
ja: [ZBX-2856] デバッグ情報を削除

source: Dashboard filtering
ja: ダッシュボードのフィルタリング

source: fixed processing of negative SNMP integers
ja: マイナスのSNMPの整数データの処理を修正

source: You may upgrade from ZABBIX 1.1, 1.1.1, 1.1.2, 1.1.3 directly to 1.1.4.
ja: ZABBIX 1.1、1.1.1、1.1.2、1.1.3から直接1.1.4にアップグレードする場合、

source: [ZBXNEXT-360] zabbix_sender now allows "-" for default hostname in input files; thanks to Dennis Jacobfeuerborn
ja: [ZBXNEXT-360] zabbix_senderで入力ファイル内に「-」を使用した場合にデフォルトのホスト名を利用可能; Dennis Jacobfeuerbornに感謝

source: Important
ja: 重要

source: [ZBX-1357] updated French translation.
ja: [ZBX-1357] フランス語訳を更新。

source: [ZBX-851] changed sorting of users to alias in popup
ja: [ZBX-851] ポップアップのユーザの並び替えをエイリアスを使用するように変更

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.8rc2 (Second Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.8rc2 (2番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-2303] fixed GET/POST methods in processing web scenario steps.
ja: [ZBX-2303] Webシナリオのステップ処理のGET/POSTメソッドを修正。

source: [ZBX-2262] added `hosts_templates_2' index
ja: [ZBX-2262] `hosts_templates_2'インデックスを追加

source: [ZBX-3175] fixed value type for 'vfs.fs.size[/var,used]' in data.sql
ja: [ZBX-3175] data.sqlの 'vfs.fs.size[/var,used]' のデータの形式を修正

source: [ZBX-620] fixed jstree error in IT Services
ja: [ZBX-620] ITサービスのjstreeエラーを修正

source: Events visible in Zabbix front-end can be exported to a CSV file with a mouse click.
ja: Zabbix Webインターフェースで表示できるイベントをマウスクリックでCSVファイルにエクスポートできます。

source: Zabbix Server
ja: Zabbixサーバ

source: [ZBX-1301] fixed discovery hosts view in dashboard
ja: [ZBX-1301] ダッシュボード上のディスカバリホストの表示を修正

source: ZABBIX Company provides full range of professional services.
ja: ZABBIX SIAはプロフェッショナルサービスを全面的に提供しています。

source: [ZBX-2199] fixed time output format when time is less then 1 ms
ja: [ZBX-2199] 1ms以下の場合の時刻出力フォーマットを修正

source: [ZBX-1358] make more graph strings translatable; patch by alixen
ja: [ZBX-1358] alexenのパッチにより、より多くのグラフの文字を翻訳できるように修正

source: [ZBX-1015] added support of LVM devices for system.swap.in/out under Linux.
ja: [ZBX-1015] Linuxのキーsystem.swap.in/outがLVMデバイスをサポート。

source: [ZBX-1909] fixed keyparser to allow keys like "key,{$USERMACRO}"
ja: [ZBX-1909] 「key,{$USERMACRO}」のようなキーを許可するようにパース処理を修正

source: [ZBX-2201] improved history page
ja: [ZBX-2201] ヒストリ画面を改善

source: [ZBX-3255] fixed string escaping under IBM DB2
ja: [ZBX-3255] IBM DB2利用時の文字列エスケープ処理を修正

source: Please note this release does not support escalation of notifications.
ja: このリリースが通知のエスカレーションをサポートしないことに注意してください。

source: fixed wrong action count in audit log
ja: 監査ログの誤ったアクションのカウントを修正

source: This document contains the release notes for Zabbix 1.8.3rc4.
ja: このドキュメントはZabbix 1.8.3rc4のリリースノートを含みます。

source: fixed SNMP-related compilation problem with undefined 'localname' under some platforms
ja: SNMP関連のコンパイル時にいくつかのプラットフォームで「localname」が定義されない問題を修正

source: [ZBX-2306] fixed links for graphs in screens
ja: [ZBX-2306] スクリーン画面のグラフのリンクを修正

source: Host name will be used for informational purposes only.
ja: ホスト名を表示目的だけに利用することができます。

source: fixed compilation of ZABBIX agent under Mac OS/X
ja: Mac OS/X上でのZABBIXエージェントのコンパイルの問題を修正

source: [ZBX-1732] added node and group name for screen widget "triggers info"
ja: [ZBX-1732] スクリーンのウィジット「トリガー情報」にノードとグループ名を追加

source: max size reduction 28%, average reduction 10%
ja: 最大サイズを28%縮小、平均10%縮小

source: changed help string for parameter '-s' of zabbix_sender
ja: zabbix_senderの-sパラメータのヘルプ表示を変更

source: [ZBX-3625] fixed validation of aggregated item keys
ja: [ZBX-3625] Zabbixアグリゲートアイテムのキーのバリデーションを修正

source: [ZBX-3105] added processing of garbage in configuration files
ja: [ZBX-3105] 設定ファイルに正しくない設定がある場合の処理を追加

source: [ZBX-2572] added configuration define for zapcat compatibility mode
ja: [ZBX-2572] zapcat互換モード用の設定定義を追加

source: [ZBX-243] speed improvements for processing of eventlog[] for windows agent
ja: [ZBX-243] Windowsエージェントのeventlog[]の処理速度を改善

source: [ZBX-2784] changed icons style
ja: [ZBX-2784] アイコンのスタイルを変更

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.4rc4 (Fourth Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.4rc4 (4番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-3123] fixed Oracle SQL errors in processing of IT services
ja: [ZBX-3123] ITサービスの処理でOracleのSQLエラーが表示される問題を修正

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.10rc1 (First Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.10rc1 (1番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: [DEV-461] changes in GUI configuration menu
ja: [DEV-461] GUIの設定メニューを変更

source: [ZBX-2739] fixed empty list of items when "all" selected in items popup
ja: [ZBX-2739] アイテムのポップアップで"全て"を選択した際にアイテムのリストが空になることを修正

source: [ZBX-3578] added arguments to the output when using agent with '-p' or '-t', modified default arguments in win32.c and common.c
ja: [ZBX-3578] エージェントの'-p'または'-t'オプション利用時に出力のオプションを追加。win32.cとcommon.c内のデフォルトオプションを変更

source: GUI improvements
ja: GUIの改善

source: [ZBX-1635] fixed possible Windows agent crash when using checks based on performance counters
ja: [ZBX-1635] パフォーマンスカウンターを利用したチェックを行う場合にWindowsエージェントがクラッシュする可能性がある問題を修正

source: [ZBX-540] DM: fixed sql error while processing configuration data
ja: [ZBX-540] 分散モニタリングの設定データ処理中のSQLエラーを修正

source: Default interval of '0' with flexible intervals may be used to enable data collection within specific time periods only.
ja: 例外の更新間隔にデフォルトの間隔「0」を利用することで、特定の期間だけデータの収集を有効にすることができます。

source: This document contains the release notes for Zabbix 1.8.6.
ja: このドキュメントはZabbix 1.8.6のリリースノートを含みます。

source: [ZBX-3100] fixed messages in popup when no proxies or discovery checks defined
ja: [ZBX-3100] プロキシまたはディスカバリチェックが定義されていない場合のポップアップのメッセージを修正

source: Zabbix interface translations are handled by GNU gettext module.
ja: ZabbixのWebインターフェイスの翻訳にGNU gettextモジュールを利用しました。

source: No upgrade of database schema required for upgrade from 1.4 or 1.4.1.
ja: 1.4、1.4.1からアップグレードする場合、データベーススキーマのアップグレードは必要ありません。

source: Unknown triggers and events will no longer be displayed in Zabbix WEB interface, a special flag will be shown if Zabbix is not confident about status of triggers or events.
ja: ZabbixのWebインターフェイスで不明なトリガーとイベントが表示されなくなります。トリガーやイベントの状態について確信が無い場合は特別なフラグが表示されます。

source: [ZBX-639] fixed numeric snmp oid for ifOutOctets.
ja: [ZBX-639] ifOutOctetsのSNMP OIDの数値を修正

source: API search wildcard was changed from "%" to more traditional "*".
ja: APIの検索ワイルドカードを「%」から「*」に変更しました。

source: [ZBX-1440] fixed error when adding global macro
ja: [ZBX-1440] グローバルマクロ追加時のエラーを修正

source: [ZBX-2836] fixed text items history not displaying all spaces in text
ja: [ZBX-2836] テキストアイテムのヒストリで全てのスペースが表示されなかった問題を修正

source: [DEV-332] added media selection for notifications
ja: [DEV-332] 通知にメディアの選択を追加

source: [ZBX-1629] added colouring of items in trigger configuration screen
ja: [ZBX-1629] トリガー設定画面にアイテムの色付けを追加

source: The communication protocol has been improved to support sending of multiple values by one TCP connection.
ja: 通信プロトコルは1つのTCPコネクションで複数のデータを送信するように改善されました。

source: minor grammar fixes
ja: 文法の修正

source: [ZBX-57] fixed problem in zbx_tcp_check_security 127.0.0.1 != 127.0.00.1
ja: [ZBX-57] zbx_tcp_check_security中の127.0.0.1 != 127.0.00.1の問題を修正

source: It is on for fresh setups.
ja: 新規でセットアップを行った場合に有効になります。

source: [ZBX-3249] added define for frontend graphing on partitioned DB data store
ja: [ZBX-3249] WebインターフェースにDBのデータストアが分割されている場合の設定項目を追加

source: [ZBX-3] fixed logging into syslog, Zabbix log levels are properly linked to syslog levels
ja: [ZBX-3] syslogへのログの書き込みについて修正し、Zabbixのログレベルをsyslogのレベルと一致するように変更

source: [ZBXNEXT-557] added TL compatibility information when executed AIX agent with --version flag
ja: [ZBXNEXT-557] --versionフラグを利用してAIXのエージェントを実行した際にTLの互換性情報を追加

source: [ZBX-948] fixed not working keyboard keys in numericboxes for Opera
ja: [ZBX-948] Operaの数値ボックスがキーボードのキーで動作しない問題を修正

source: [ZBX-3406] better API validation
ja: [ZBX-3406] APIのvalidationを改善

source: This document contains the release notes for Zabbix 1.8.5.
ja: このドキュメントはZabbix 1.8.5のリリースノートを含みます。

source: ZABBIX front-end is UTF-8 ready.
ja: ZABBIXフロントエンドにUTF-8を使用することができます。

source: [ZBX-2937] fixed missing style files for IE
ja: [ZBX-2937] IE用のスタイルファイルがなかった問題を修正

source: Pie charts
ja: 円グラフ

source: Non-case sensitive function iregexp()
ja: 大文字と小文字を区別しない関数iregexp()

source: Regular expression builder helps to create and maintain complex regular expressions used for log monitoring.
ja: ログ監視に利用する複雑な正規表現の管理を、正規表現の作成画面から行うことができます。

source: Zabbix fully supports UTF8, which makes it ready for use with multiple languages.
ja: ZabbixはUTF8を完全にサポートします。マルチバイト言語を使用することができます。

source: [ZBX-2979] fixed trigger function time() test
ja: [ZBX-2979] トリガー関数time()のテストを修正

source: [ZBX-1403] fixed discovery widget to show only discovery from selected node
ja: [ZBX-1403] 選択されたノードから発見されたものだけを表示するようにディスカバリウィジットを修正

source: fixed no graphs for PostgreSQL
ja: PostgreSQLのグラフが出力されない問題を修正

source: [DEV-137] minor fix for PostgreSQL patch
ja: [DEV-137] PostgreSQLパッチを一部修正

source: The proxies can be used in order to centralise monitoring of remote locations by reporting to the central server or one of ZABBIX nodes in the distributed environment.
ja: プロキシを利用し、分散環境において中央のサーバまたはZABBIXノードの1つにデータを送信することによって、遠隔地の集中監視を行うことができます。

source: Thanks to Kirill Fateev
ja: Kirill Fateevに感謝

source: It is optimized for high performance yet easy to use.
ja: ハイパフォーマンスかつ簡単に利用できるように最適化されています。

source: Zabbix WEB monitoring supports NTLM authentication.
ja: ZabbixのWeb監視機能がNTLM認証に対応しました。

source: We announce feature freeze!
ja: 私たちはフィーチャーフリーズをアナウンスします！

source: [ZBX-1317] fixed resource type for maintenance in audit
ja: [ZBX-1317] 監査画面のメンテナンスのリソースタイプの問題を修正

source: [DEV-323] removed master nodes from dropdown
ja: [DEV-323] ドロップダウンからマスターノードを削除

source: [ZBX-1915] fixed template/host name check on creation/update
ja: [ZBX-1915] 作成/更新時のテンプレート/ホスト名チェックを修正

source: 1 September 2011
ja: 2011年9月1日

source: [ZBX-4005] updated French translation; thanks to Joseph Bueno
ja: [ZBX-4005] フランス語翻訳を更新; Joseph Buenoに感謝

source: [ZBX-2193] updated Russian translation; thanks to dotneft
ja: [ZBX-2193] ロシア語訳の更新; dotneftに感謝

source: This document contains the release notes for Zabbix 1.8.4.
ja: このドキュメントはZabbix 1.8.4のリリースノートを含みます。

source: [ZBX-44] added timeout handler for processing net.tcp.* items
ja: [ZBX-44] net.tcp.*アイテムの処理にタイムアウトを追加

source: [ZBX-159] added support of vm.memory.size[available] under Linux
ja: [ZBX-159] Linux用エージェントにアイテムvm.memory.size[available]を追加

source: ZABBIX is released under the GPL, thus it is free of charge for both commercial and non-commercial use.
ja: ZABBIXはGPLライセンスの元で配布されているため、商用、非商用問わず無償で利用することができます。

source: [ZBX-412] fixed malfunction of triggers based on log[] and eventlog[]
ja: [ZBX-412] log[]とeventlog[]を使用した場合のトリガーの誤動作を修正

source: added support of update interval in icmpping* simpe checks
ja: icmpping*シンプルチェックに更新間隔の設定機能を追加

source: fixed screen clock set to server time showed local time
ja: スクリーンの時刻をサーバ時間に修正するとローカル時間が表示される問題を修正

source: Improvements of poller process
ja: pollerプロセスの改善

source: [ZBX-1502] fixed full clone of hosts
ja: [ZBX-1502] ホストの完全複製を修正

source: The items are built on top of other items and use data stored in Zabbix database.
ja: このアイテムを利用することにより他のアイテムを元にしてデータベースにデータを保存することができます。

source: [ZBX-3847] fixed item history clearing not deleting data in trends_uint table
ja: [ZBX-3847] アイテムのヒストリをクリアしてもtrends_uintテーブルのデータが削除されない問題を修正

source: [ZBX-1082] fixed map label background
ja: [ZBX-1082] マップのラベルの背景を修正

source: Please let us know if you think some critical features are missing.
ja: 重要な機能が不足している点があれば、私たちまでお知らせください。

source: New action will contain two conditions be default: "Trigger value = Problem" and "Not in maintenance"
ja: 新規アクション設定に「トリガーの値 = "障害"」と「メンテナンスの状態 期間外 "メンテナンス"」の2つの条件がデフォルトで含まれるようになりました。

source: Also added support of <mode> for system.cpu.util under Solaris.
ja: また、Solarisのアイテムsystem.cpu.utilに<mode>オプションを追加。

source: [ZBX-2775] updated Brazilian Portuguese translation; thanks to Murilo Moreira de Oliveira
ja: [ZBX-2775] ポルトガル語(ブラジル)翻訳を改善; Murilo Moreira de Oliveiraに感謝

source: [ZBX-3523] fixed error when open monitoring->maps and last viewed map was removed
ja: [ZBX-3523] 監視データ->マップ画面表示時に最後に表示していたマップが削除されていた場合ののエラーを修正

source: [ZBX-100] fixed Oracle compilation errors
ja: [ZBX-100] Oracle利用時のコンパイルエラーを修正

source: Better trigger expressions
ja: より良いトリガー条件式

source: Zabbix 1.8 was created in collaboration with NTT ComTechnology Corporation(Zabbix Premium Partner), whose support made possible implementation of some major features in this release.
ja: Zabbix 1.8はNTTコムテクノロジー(Zabbixプレミアムパートナー)とのコラボレーションにより作成されました。彼らは今回のリリース内のいくつかの実装に対してサポートしてくれました。

source: [ZBX-604] fixed compilation problems under AIX 2.5.1
ja: [ZBX-604] AIX 2.5.1上のコンパイル時の問題を修正

source: Performance, availability and integrity of WEB applications can be monitored by ZABBIX.
ja: ZABBIXによって、WEBアプリケーションのパフォーマンス、可用性、完全性を監視することができます。

source: Please do not upgrade production systems!
ja: 本番稼働中のシステムをアップグレードしないでください。

source: This document contains the release notes for Zabbix 1.8.3.
ja: このドキュメントはZabbix 1.8.3のリリースノートを含みます。

source: Monitoring of LVM devices
ja: LVMデバイスの監視

source: [ZBX-2792] fixed status sorting in maintenances
ja: [ZBX-2792] メンテナンス画面のステータスのソート処理を修正

source: [ZBX-501] fixed undefined values in server info screen
ja: [ZBX-501] サーバ情報画面の定義されていない値の問題を修正

source: [ZBX-1568] make 'Parent service' string translatable; patch by Kodai
ja: [ZBX-1568] 'Parent service'の文字列を翻訳できるように修正; Kodaiによるパッチ

source: [ZBXNEXT-425] added new macros for acknowledged events count
ja: [ZBXNEXT-425] 障害対応コメントが入力されたイベントをカウントする新しいマクロを追加

source: [ZBX-3498] removed items from unmonitored hosts from the 'Add graph' and 'Add simple graph' pop-ups in the 'Favourite graphs' widget
ja: [ZBX-3498] 「お気に入りのグラフ」ウィジェットの「追加 グラフ」や「追加 シンプルグラフ」のポップアップから監視していないホストのアイテムを削除

source: [ZBX-1371] improved performance of the configuration screens hostgroups, templates, hosts
ja: [ZBX-1371] ホストグループ、テンプレート、ホストの設定画面のパフォーマンスの改善

source: [ZBX-2855] fixed new line symbol for latest opera browser
ja: [ZBX-2855] 最新のOperaブラウザのために改行文字を修正

source: Access to template configuration is much easier now, it is a separate menu item.
ja: テンプレートの設定を個別のメニューに分離し、アクセスを容易にしました。

source: [ZBX-632] fixed sql query in map elements configuration form
ja: [ZBX-632] マップの要素の設定フォームのSQLクエリを修正

source: [ZBX-2597] fixed processing of telnet results with long prompts
ja: [ZBX-2597] 長いプロンプトを持つtelnetの結果の処理を修正

source: [ZBX-3385] fixed trigger status change record in audit log
ja: [ZBX-3385] 監査ログのトリガー状態変更レコードを修正

source: [ZBX-3431] fixed severity for log and eventlog or mixed
ja: [ZBX-3431] logとeventlogまたは混在時の深刻度を修正

source: A brief preview of the new functionality with screenshots can be found here: http://www.zabbix.com/documentation/1.8/manual/about/what_s_new
ja: 新機能の簡単な概要とスクリーンショットはここから参照することができます。http://www.zabbix.com/documentation/1.8/manual/about/what_s_new

source: Installation Wizard
ja: インストールウィザード

source: [ZBX-490] fixed undefined variable in latest data
ja: [ZBX-490] 最新データの定義されていない値の問題を修正

source: This document contains the release notes for ZABBIX 1.3.1.
ja: このドキュメントはZABBIX 1.3.1のリリースノートです。

source: [ZBX-2321] fixed log items appearing in the wrong order
ja: [ZBX-2321] ログアイテムが間違った順序で表示される問題を修正

source: ZABBIX SIA is proud to announce the availability of Zabbbix 1.7 (alpha).
ja: ZABBIX SIAはZABBIX 1.7(alpha)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-336] fixed vtext.php
ja: [ZBX-336] vtext.phpの修正
